---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExternallyTaggedBRep
source: html/f0c588cb-4421-48a1-0704-738f6ceabcf3.htm
---
# ExternallyTaggedBRep Properties

The external Id of the geometry object.